app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries"
---
  def index
    @entries = Entry.all

INSERT INTO "entries" ("main", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["main", "Let's add something here."], ["date", "2020-12-15"], ["created_at", "2020-12-08 22:27:55.472520"], ["updated_at", "2020-12-08 22:27:55.472520"]]
---
  def create
    @entry = Entry.new(entry_params)

    if @entry.save

UPDATE "entries" SET "date" = $1, "updated_at" = $2 WHERE "entries"."id" = $3  [["date", "2020-12-05"], ["updated_at", "2020-12-06 23:55:22.494624"], ["id", 1]]
---
  def update
    if @entry.update(entry_params)

DELETE FROM "entries" WHERE "entries"."id" = $1  [["id", 1]]
---
  def destroy
    @entry.destroy

SELECT "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_entry
      @entry = Entry.find(params[:id])