app/controllers/entries_controller.rb

  def index
    @entries = Entry.where(user_id: @user.id)
---
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = $1  [["user_id", 1]]